## ***************************************    Methods to Create Pandas series ************************

In [3]:
import numpy as np
import pandas as pd

## Method 1: Using an Array

In [4]:
s = ([1,np.nan, ' Pandas Library '])
s1 = pd.Series(s)
s1

0                   1
1                 NaN
2     Pandas Library
dtype: object

# => Challenge

Create a Pandas Series, named as s2.
Use the array, named s2, containing the following:

* Integer = 2                         
* Nan Value                  
* Character = b

In [5]:
s2 = np.array([2,np.nan,'b'])
s2 = pd.Series(s2)
s2

0      2
1    nan
2      b
dtype: object

# Method 2: Using a list

In [6]:
list1 = ['animal','2','animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

# => Challenge

Create a Pandas Series, named s4.

Use a list, named list2, containing the following:                         
* Integer = 3                  
* Character = c                                
* String = Numpy                  

Note: 'N' must be capital

In [7]:
list2 = ['3', 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

# Method 3: Using a Dictionary

In [8]:
s5 = pd.Series(
    {
        'A': 1,
        '3': 'Python',
    })
s5

A         1
3    Python
dtype: object

# => Challenge

Create a Pandas Series, named as s6, containing the following:            

* 'Integer' = 3            
* 'B' = Boys

In [9]:
s6 = pd.Series(
{
    'Integer': 3,
    'B': 'Boys',
})
s6

Integer       3
B          Boys
dtype: object

## ***********************    CREATING DATA FRAMES *******************************************

=>  Combining two series , we get a data frame..

# Method 1: Passing a Numpy Array

In [10]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0 -1.424186 -0.800322  1.627696  0.519452
1 -0.956191  0.062905 -0.226460 -0.531728
2 -0.885391 -0.345090 -0.083924  0.637234
3  0.379945  2.399215 -0.188615 -0.987338
4  0.250298  0.981909  0.296626 -0.233786
5  2.167520  0.847572 -0.151463 -1.422937

# => Challenge

Create a data frame, named df1, which contains:

 * A randomly generated array with the dimensions 3*3

In [11]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0  0.076727 -0.867906  0.254884
1  0.477835 -0.513714  0.086788
2  0.436333 -1.311131 -0.101386

# Method 2: Passing a Dictionary of Objects

In [12]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3,dtype='int32'),
})
df2

   A  number
0  1       6
1  1       6
2  1       6

# => Challenge

Create a data frame, named df3, which contains:
* 'E' = np.array([4]*5,dtype='int32')
* 'Day' = 2

In [15]:
df3 = pd.DataFrame({
    'E': np.array([4]*5,dtype='int32'),
    'Day': 2,
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

# ***********************  Importing Files ***************************

.csv  files

Use file path:  F:\MY Projects\practicedata.csv

In [16]:
df4 = pd.read_csv('F:\MY Projects\practicedata.csv')
df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

# => Challenge

Import the file 'practicedata.json' in the dataframe df5.

Use the file path F:\MY Projects\practicedata.json

In [19]:
df5 = pd.read_json('F:\MY Projects\practicedata.json')
df5

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

# Importing files from a url

Import data from this github repo: ("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [21]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

# => Challenge

Create the dataframe df7.

Then, import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [22]:
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head(5)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

# ***************  Export files *******************************

.csv files               

Use file path: F:\MY Projects

In [23]:
df4.to_csv('F:\MY Projects\practicedata2.csv')

# => Challenge

Export the data in df4, to 'practicedata2.json'         

Use the file path: F:\MY Projects

In [24]:
df4.to_json('F:\MY Projects\practicedata2.json')

# ******** DATA Summary ********************

We will be working with data frame df6 for this section.

In [26]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

# Quick Summary of Data

In [27]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 320.0 bytes

# Detailed Summary of Data

In [28]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

# View Columns

In [29]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

# => Challenge

View the columns in df7

In [30]:
#first run this cell to import data into df7
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [31]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

# **********  View Datatypes ******************

In [32]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

# => Challenge

View the datatypes in df7

In [33]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

# ****************  Handling Duplicates  ************

In [34]:
#  DETECT  DUPLICATE ROWS

df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [35]:
# DROP DUPLICATE  ROWS

df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

# => Challenges

Detect and drop duplicates in df7

In [36]:
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [38]:
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

# ******** Handling Missing Values ********

In [39]:
# Detect  Missing  Values

print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [40]:
# Drop  Missing  Values 

df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

# => Challenge

Detect and drop missing values in df7

In [41]:
# Detect

print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [42]:
# Drop

df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912